-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Apr 14, 2024 at 03:34 PM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `chronos`
--

-- --------------------------------------------------------

--
-- Table structure for table `intervenants`
--

CREATE TABLE `intervenants` (
  `id` int(11) NOT NULL,
  `nbHours` float NOT NULL DEFAULT 0,
  `file` mediumtext DEFAULT NULL,
  `createdAt` datetime NOT NULL,
  `updatedAt` datetime NOT NULL,
  `intervenantID` int(11) DEFAULT NULL,
  `projectID` int(11) DEFAULT NULL,
  `taskID` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `intervenants`
--

INSERT INTO `intervenants` (`id`, `nbHours`, `file`, `createdAt`, `updatedAt`, `intervenantID`, `projectID`, `taskID`) VALUES
(1, 0, NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23', 1, 1, 1),
(2, 0, NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23', 1, 1, 2),
(3, 0, NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23', 1, 2, 3),
(4, 0, NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23', 1, 2, 4),
(5, 0, NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23', 1, 2, 5),
(6, 0, NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23', 1, 2, 6),
(7, 0, NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23', 1, 3, 7),
(8, 0, NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23', 1, 3, 8),
(9, 0, NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23', 1, 3, 9),
(10, 0, NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23', 1, 4, 10),
(11, 0, NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23', 1, 4, 11),
(12, 0, NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23', 1, 5, 12),
(13, 0, NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23', 1, 5, 13),
(14, 0, NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23', 1, 5, 14),
(15, 0, NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23', 1, 6, 15),
(16, 0, NULL, '2024-01-26 11:52:23', '2024-01-29 09:35:42', 6, 7, 16),
(17, 0, NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23', NULL, 7, 17),
(18, 0, NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23', NULL, 7, 18),
(19, 0, NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23', NULL, 8, 19),
(20, 0, NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23', NULL, 8, 20),
(21, 0, NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23', NULL, 9, 21),
(22, 0, NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23', NULL, 10, 22),
(23, 0, NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23', NULL, 10, 23),
(24, 0, NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23', NULL, 10, 24),
(25, 0, NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23', NULL, 11, 25),
(26, 0, NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23', NULL, 11, 26),
(27, 0, NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23', NULL, 12, 27),
(28, 0, NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23', NULL, 12, 28),
(29, 0, NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23', NULL, 12, 29),
(30, 0, NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23', NULL, 12, 30),
(31, 0, NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', NULL, 12, 31),
(32, 0, NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', NULL, 13, 32),
(33, 0, NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', NULL, 13, 33),
(34, 0, NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', NULL, 14, 34),
(35, 0, NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', NULL, 15, 35),
(36, 0, NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', NULL, 15, 36),
(37, 0, NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', NULL, 15, 37),
(38, 0, NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', NULL, 15, 38),
(39, 0, NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', NULL, 16, 39),
(40, 0, NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', NULL, 16, 40),
(42, 0, NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', NULL, 17, 42),
(43, 0, NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', NULL, 18, 43),
(44, 0, NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', NULL, 19, 44),
(45, 0, NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', NULL, 19, 45),
(46, 0, NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', NULL, 19, 46),
(47, 0, NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', NULL, 20, 47),
(48, 0, NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', NULL, 21, 48),
(49, 0, NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', NULL, 21, 49),
(50, 0, NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', NULL, 21, 50),
(51, 0, NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', NULL, 21, 51),
(52, 0, NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', NULL, 22, 52),
(53, 0, NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', NULL, 23, 53),
(54, 0, NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', NULL, 24, 54),
(55, 0, NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', NULL, 24, 55),
(56, 0, NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', NULL, 24, 56),
(57, 0, NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', NULL, 25, 57),
(58, 0, NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', NULL, 25, 58),
(59, 0, NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', NULL, 26, 59),
(60, 0, NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', NULL, 26, 60),
(61, 0, NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', NULL, 26, 61),
(62, 0, NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', NULL, 26, 62),
(63, 0, NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', NULL, 26, 63),
(64, 0, NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', NULL, 27, 64),
(65, 0, NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', NULL, 28, 65),
(66, 0, NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', NULL, 28, 66),
(67, 2, NULL, '2024-01-26 11:52:24', '2024-01-29 09:35:42', 6, 29, 67),
(68, 0, NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', NULL, 29, 68),
(69, 13, NULL, '2024-01-26 11:52:24', '2024-01-29 09:35:42', 6, 29, 69),
(70, 4, NULL, '2024-01-26 11:52:24', '2024-01-29 09:34:37', 6, 29, 70),
(71, 0, NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', NULL, 30, 71),
(72, 0, NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', NULL, 30, 72),
(73, 0, NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', NULL, 30, 73),
(74, 0, NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', NULL, 30, 74),
(75, 0, NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', NULL, 30, 75),
(76, 0, NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', NULL, 30, 76),
(77, 0, NULL, '2024-01-26 15:32:25', '2024-01-26 15:32:25', 6, 7, NULL),
(78, 0, NULL, '2024-01-26 15:32:53', '2024-01-26 15:32:53', 6, 29, NULL),
(79, 0, NULL, '2024-01-26 15:34:57', '2024-01-26 15:34:57', 6, 11, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `interventionhours`
--

CREATE TABLE `interventionhours` (
  `id` int(11) NOT NULL,
  `hours` float NOT NULL DEFAULT 0,
  `date` date NOT NULL DEFAULT '2024-04-05',
  `createdAt` datetime NOT NULL,
  `updatedAt` datetime NOT NULL,
  `interventionID` int(11) DEFAULT NULL,
  `projectID` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `interventionhours`
--

INSERT INTO `interventionhours` (`id`, `hours`, `date`, `createdAt`, `updatedAt`, `interventionID`, `projectID`) VALUES
(1, 0, '2024-01-26', '2024-01-26 15:35:53', '2024-01-26 15:35:53', 16, NULL),
(2, 8, '2024-01-26', '2024-01-26 15:35:53', '2024-01-26 15:35:53', 69, NULL),
(3, 0, '2024-01-29', '2024-01-29 09:34:37', '2024-01-29 09:35:42', 16, NULL),
(4, 2, '2024-01-29', '2024-01-29 09:34:37', '2024-01-29 09:35:42', 67, NULL),
(5, 5, '2024-01-29', '2024-01-29 09:34:37', '2024-01-29 09:35:42', 69, NULL),
(6, 4, '2024-01-29', '2024-01-29 09:34:37', '2024-01-29 09:34:37', 70, NULL),
(7, 2, '2024-01-29', '2024-01-29 11:23:05', '2024-01-29 11:23:05', NULL, 21),
(8, 2, '2024-01-29', '2024-01-29 11:23:05', '2024-01-29 11:23:05', NULL, 22),
(9, 1, '2024-01-29', '2024-01-29 11:23:05', '2024-01-29 11:23:05', NULL, 23),
(10, 4, '2024-01-29', '2024-01-29 11:23:05', '2024-01-29 11:23:05', NULL, 24),
(11, 0, '2024-01-29', '2024-01-29 11:23:05', '2024-01-29 11:23:05', NULL, 25),
(12, 0, '2024-01-29', '2024-01-29 11:23:05', '2024-01-29 11:23:05', NULL, 26),
(13, 0, '2024-01-29', '2024-01-29 11:23:05', '2024-01-29 11:23:05', NULL, 27),
(14, 0, '2024-01-29', '2024-01-29 11:23:05', '2024-01-29 11:23:05', NULL, 28),
(15, 0, '2024-01-29', '2024-01-29 11:23:05', '2024-01-29 11:23:05', NULL, 29),
(16, 0, '2024-01-29', '2024-01-29 11:23:05', '2024-01-29 11:23:05', NULL, 30),
(17, 0, '2024-04-09', '2024-04-09 14:31:12', '2024-04-09 14:31:12', NULL, 1),
(18, 0, '2024-04-09', '2024-04-09 14:31:12', '2024-04-09 14:31:12', NULL, 2),
(19, 0, '2024-04-09', '2024-04-09 14:31:12', '2024-04-09 14:31:12', NULL, 3),
(20, 0, '2024-04-09', '2024-04-09 14:31:12', '2024-04-09 14:31:12', NULL, 4),
(21, 0, '2024-04-09', '2024-04-09 14:31:12', '2024-04-09 14:31:12', NULL, 7),
(22, 8, '2024-04-09', '2024-04-09 14:31:12', '2024-04-09 14:31:12', NULL, 9),
(23, 0, '2024-04-09', '2024-04-09 14:31:12', '2024-04-09 14:31:12', NULL, 10),
(24, 0, '2024-04-09', '2024-04-09 14:31:12', '2024-04-09 14:31:12', NULL, 12),
(25, 0, '2024-04-09', '2024-04-09 14:31:12', '2024-04-09 14:31:12', NULL, 14),
(26, 0, '2024-04-09', '2024-04-09 14:31:12', '2024-04-09 14:31:12', NULL, 17),
(27, 0, '2024-04-09', '2024-04-09 14:31:12', '2024-04-09 14:31:12', NULL, 20),
(28, 0, '2024-04-09', '2024-04-09 14:31:12', '2024-04-09 14:31:12', NULL, 22),
(29, 0, '2024-04-09', '2024-04-09 14:31:12', '2024-04-09 14:31:12', NULL, 28),
(30, 0, '2024-04-09', '2024-04-09 14:31:12', '2024-04-09 14:31:12', NULL, 29);

-- --------------------------------------------------------

--
-- Table structure for table `leaves`
--

CREATE TABLE `leaves` (
  `id` int(11) NOT NULL,
  `dateDebut` datetime NOT NULL,
  `dateFin` datetime DEFAULT NULL,
  `type` varchar(255) NOT NULL,
  `status` varchar(255) DEFAULT 'En cours',
  `createdAt` datetime NOT NULL,
  `updatedAt` datetime NOT NULL,
  `userID` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `leaves`
--

INSERT INTO `leaves` (`id`, `dateDebut`, `dateFin`, `type`, `status`, `createdAt`, `updatedAt`, `userID`) VALUES
(45, '2023-04-16 03:29:40', '2023-05-01 03:29:40', 'Congé', 'Accepté', '2024-04-08 14:07:38', '2024-04-08 14:07:38', 2),
(59, '2024-04-20 00:00:00', '2024-04-22 00:00:00', 'Maladie', 'Accepté', '2024-04-11 19:35:17', '2024-04-11 22:20:33', 1),
(60, '2024-04-30 00:00:00', '2024-05-10 00:00:00', 'Congé', 'Refusé', '2024-04-11 19:35:35', '2024-04-11 22:21:32', 1),
(61, '2024-04-19 00:00:00', '2024-05-01 00:00:00', 'Annuelle', 'Accepté', '2024-04-11 19:41:23', '2024-04-14 13:19:47', 1),
(62, '2025-06-19 00:00:00', '2025-06-23 00:00:00', 'Annuelle', 'En cours', '2024-04-12 11:20:07', '2024-04-12 11:20:07', 1),
(63, '2024-02-06 00:00:00', '2024-02-20 00:00:00', 'Maternité', 'En cours', '2024-04-12 23:30:07', '2024-04-12 23:30:07', 1),
(64, '2024-04-11 00:00:00', '2024-04-19 00:00:00', 'Annuelle', 'Accepté', '2024-04-14 11:51:17', '2024-04-14 11:52:24', 1);

-- --------------------------------------------------------

--
-- Table structure for table `lots`
--

CREATE TABLE `lots` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `createdAt` datetime NOT NULL,
  `updatedAt` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `lots`
--

INSERT INTO `lots` (`id`, `name`, `createdAt`, `updatedAt`) VALUES
(1, 'GO', '2023-10-17 08:35:58', '2023-10-17 08:35:58'),
(2, 'CM', '2023-10-17 08:36:03', '2023-10-17 08:36:03');

-- --------------------------------------------------------

--
-- Table structure for table `phases`
--

CREATE TABLE `phases` (
  `id` int(11) NOT NULL,
  `name` varchar(3) NOT NULL,
  `abbreviation` char(255) NOT NULL,
  `createdAt` datetime NOT NULL,
  `updatedAt` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `phases`
--

INSERT INTO `phases` (`id`, `name`, `abbreviation`, `createdAt`, `updatedAt`) VALUES
(1, 'APS', 'P', '2023-10-18 15:31:32', '2023-10-18 15:31:32'),
(2, 'APD', 'P', '2023-10-18 15:31:45', '2023-10-18 15:31:45'),
(3, 'DCE', 'D', '2023-10-18 15:32:19', '2023-10-18 15:32:19'),
(4, 'EXE', 'X', '2023-10-18 15:32:31', '2023-10-18 15:32:31'),
(5, 'DOE', 'E', '2023-10-18 15:32:43', '2023-10-18 15:32:43');

-- --------------------------------------------------------

--
-- Table structure for table `projectlots`
--

CREATE TABLE `projectlots` (
  `createdAt` datetime NOT NULL,
  `updatedAt` datetime NOT NULL,
  `projectID` int(11) NOT NULL,
  `lotID` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `projectlots`
--

INSERT INTO `projectlots` (`createdAt`, `updatedAt`, `projectID`, `lotID`) VALUES
('2024-01-26 11:52:23', '2024-01-26 11:52:23', 1, 1),
('2024-01-26 11:52:23', '2024-01-26 11:52:23', 1, 2),
('2024-01-26 11:52:23', '2024-01-26 11:52:23', 2, 1),
('2024-01-26 11:52:23', '2024-01-26 11:52:23', 3, 1),
('2024-01-26 11:52:23', '2024-01-26 11:52:23', 4, 1),
('2024-01-26 11:52:23', '2024-01-26 11:52:23', 5, 1),
('2024-01-26 11:52:23', '2024-01-26 11:52:23', 6, 1),
('2024-01-26 11:52:23', '2024-01-26 11:52:23', 6, 2),
('2024-01-26 11:52:23', '2024-01-26 11:52:23', 7, 1),
('2024-01-26 11:52:23', '2024-01-26 11:52:23', 8, 1),
('2024-01-26 11:52:23', '2024-01-26 11:52:23', 9, 1),
('2024-01-26 11:52:23', '2024-01-26 11:52:23', 10, 1),
('2024-01-26 11:52:23', '2024-01-26 11:52:23', 11, 1),
('2024-01-26 11:52:23', '2024-01-26 11:52:23', 12, 1),
('2024-01-26 11:52:24', '2024-01-26 11:52:24', 13, 2),
('2024-01-26 11:52:24', '2024-01-26 11:52:24', 15, 1),
('2024-01-26 11:52:24', '2024-01-26 11:52:24', 16, 1),
('2024-01-26 11:52:24', '2024-01-26 11:52:24', 17, 1),
('2024-01-26 11:52:24', '2024-01-26 11:52:24', 18, 1),
('2024-01-26 11:52:24', '2024-01-26 11:52:24', 19, 1),
('2024-01-26 11:52:24', '2024-01-26 11:52:24', 20, 1),
('2024-01-26 11:52:24', '2024-01-26 11:52:24', 21, 1),
('2024-01-26 11:52:24', '2024-01-26 11:52:24', 22, 1),
('2024-01-26 11:52:24', '2024-01-26 11:52:24', 23, 1),
('2024-01-26 11:52:24', '2024-01-26 11:52:24', 23, 2),
('2024-01-26 11:52:24', '2024-01-26 11:52:24', 24, 1),
('2024-01-26 11:52:24', '2024-01-26 11:52:24', 25, 1),
('2024-01-26 11:52:24', '2024-01-26 11:52:24', 26, 1),
('2024-01-26 11:52:24', '2024-01-26 11:52:24', 26, 2),
('2024-01-26 11:52:24', '2024-01-26 11:52:24', 27, 1),
('2024-01-26 11:52:24', '2024-01-26 11:52:24', 28, 1),
('2024-01-26 11:52:24', '2024-01-26 11:52:24', 29, 1),
('2024-01-26 11:52:24', '2024-01-26 11:52:24', 30, 1);

-- --------------------------------------------------------

--
-- Table structure for table `projects`
--

CREATE TABLE `projects` (
  `id` int(11) NOT NULL,
  `code` varchar(255) NOT NULL,
  `customId` varchar(255) DEFAULT NULL,
  `name` varchar(255) NOT NULL,
  `startDate` datetime NOT NULL,
  `dueDate` datetime DEFAULT NULL,
  `priority` int(11) DEFAULT NULL,
  `createdBy` int(11) NOT NULL,
  `manager` int(11) NOT NULL,
  `managerHours` float NOT NULL DEFAULT 0,
  `isCodeCustomized` tinyint(1) NOT NULL DEFAULT 0,
  `active` tinyint(1) NOT NULL DEFAULT 1,
  `state` varchar(255) NOT NULL DEFAULT 'doing',
  `prevPhaseTmp` varchar(255) DEFAULT NULL,
  `createdAt` datetime NOT NULL,
  `updatedAt` datetime NOT NULL,
  `phaseID` int(11) DEFAULT NULL,
  `prevPhase` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `projects`
--

INSERT INTO `projects` (`id`, `code`, `customId`, `name`, `startDate`, `dueDate`, `priority`, `createdBy`, `manager`, `managerHours`, `isCodeCustomized`, `active`, `state`, `prevPhaseTmp`, `createdAt`, `updatedAt`, `phaseID`, `prevPhase`) VALUES
(1, '23044', '23044D_Feu vert IVECO', 'Feu vert IVECO', '2023-11-13 17:12:47', '0000-00-00 00:00:00', 2, 2, 3, 0, 0, 1, 'doing', NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23', 3, NULL),
(2, '23103', '23103X_Matourienne_2OH', 'Matourienne_2OH', '2023-11-09 17:52:49', '0000-00-00 00:00:00', 3, 2, 1, 0, 0, 1, 'doing', NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23', 4, NULL),
(3, '23100', '23100X_RADAMONTHE BLS', 'RADAMONTHE BLS', '2023-11-01 07:26:29', '0000-00-00 00:00:00', 3, 2, 5, 0, 0, 1, 'blocked', NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23', 4, NULL),
(4, '23095', '23095X_Bravo BLS', 'Bravo BLS', '2023-11-01 07:21:14', '0000-00-00 00:00:00', 3, 2, 3, 0, 0, 1, 'blocked', NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23', 4, NULL),
(5, '23096', '23096X_Double 630_800', 'Double 630_800', '2023-10-31 08:40:19', '0000-00-00 00:00:00', 3, 2, 4, 0, 0, 1, 'blocked', NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23', 4, NULL),
(6, '23050', '23050X_2 Passerelles Lycée IV', '2 Passerelles Lycée IV', '2023-10-24 15:13:05', '0000-00-00 00:00:00', 3, 2, 4, 0, 0, 1, 'done', NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23', 4, NULL),
(7, '23093', '23093X_Clotilde Mylene', 'Clotilde Mylene', '2023-10-24 15:09:21', '0000-00-00 00:00:00', 3, 2, 3, 0, 0, 1, 'blocked', NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23', 4, NULL),
(8, '23099', '23099P_Poste Rémire-Montjoly - AVP', 'Poste Rémire-Montjoly - AVP', '2023-10-24 07:56:33', '0000-00-00 00:00:00', 1, 2, 4, 0, 0, 1, 'done', NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23', 1, NULL),
(9, '23071', '23071X_Dieu Merci à saint Elie', 'Dieu Merci à saint Elie', '2023-10-23 16:34:44', '0000-00-00 00:00:00', 3, 2, 5, 8, 0, 1, 'blocked', NULL, '2024-01-26 11:52:23', '2024-04-09 14:31:12', 4, NULL),
(10, '23020', '23020X_Dalot mancelière', 'Dalot mancelière', '2023-10-19 08:30:16', '0000-00-00 00:00:00', 3, 2, 4, 0, 0, 1, 'doing', NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23', 4, NULL),
(11, '22053', '22053D_Piscine Saint Laurent', 'Piscine Saint Laurent', '2023-10-17 13:29:39', '0000-00-00 00:00:00', 2, 2, 4, 0, 0, 1, 'blocked', NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23', 3, NULL),
(12, '23097', '23097X_BAT ADM RIBAL TP', 'BAT ADM RIBAL TP', '2023-10-16 17:15:58', '0000-00-00 00:00:00', 3, 2, 1, 0, 0, 1, 'blocked', NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23', 4, NULL),
(13, '23089', '23089X_Centrale PV', 'Centrale PV', '2023-10-12 07:50:05', '0000-00-00 00:00:00', 3, 2, 5, 0, 0, 1, 'done', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', 4, NULL),
(14, '23046', '23046X_Toiture Hyper U', 'Toiture Hyper U', '2023-10-11 13:43:12', '0000-00-00 00:00:00', 3, 2, 3, 0, 0, 1, 'blocked', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', 4, NULL),
(15, '23083', '23083X_Caniveau Crique Mouche', 'Caniveau Crique Mouche', '2023-10-11 11:21:49', '0000-00-00 00:00:00', 3, 2, 1, 0, 0, 1, 'done', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', 4, NULL),
(16, '23086', '23086X_Mezzanine HU Cayenne', 'Mezzanine HU Cayenne', '2023-10-11 11:19:52', '0000-00-00 00:00:00', 3, 2, 2, 0, 0, 1, 'blocked', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', 4, NULL),
(17, '23087', '23087X_Robot HU Cayenne', 'Robot HU Cayenne', '2023-10-10 16:43:50', '0000-00-00 00:00:00', 3, 2, 2, 0, 0, 1, 'doing', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', 4, NULL),
(18, '23088', '23088X_Bâtiment ASPAG ROROTA', 'Bâtiment ASPAG ROROTA', '2023-10-06 10:17:28', '0000-00-00 00:00:00', 3, 2, 2, 0, 0, 1, 'done', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', 4, NULL),
(19, '23084', '23084X_Centre d\'acceuil ZAC Tigre', 'Centre d\'acceuil ZAC Tigre', '2023-10-04 08:42:17', '0000-00-00 00:00:00', 3, 2, 2, 0, 0, 1, 'done', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', 4, NULL),
(20, '23085', '23085X_GS BORICAL', 'GS BORICAL', '2023-10-04 08:33:27', '0000-00-00 00:00:00', 3, 2, 1, 0, 0, 1, 'blocked', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', 4, NULL),
(21, '23082', '23082X_TSM Yannick BLS', 'TSM Yannick BLS', '2023-10-03 15:13:41', '0000-00-00 00:00:00', 3, 2, 4, 2, 0, 1, 'done', NULL, '2024-01-26 11:52:24', '2024-01-29 11:23:05', 4, NULL),
(22, '23x26', '23x26D_Frangipane', 'Frangipane', '2023-10-03 08:49:27', '0000-00-00 00:00:00', 2, 2, 4, 2, 0, 1, 'blocked', NULL, '2024-01-26 11:52:24', '2024-01-29 11:23:05', 3, NULL),
(23, '23094', '23094D_Socici', 'Socici', '2023-10-02 15:04:49', '0000-00-00 00:00:00', 2, 2, 2, 1, 0, 1, 'done', NULL, '2024-01-26 11:52:24', '2024-01-29 11:23:05', 3, NULL),
(24, '23023', '23023D_Veterinaire', 'Veterinaire', '2023-09-29 16:37:56', '0000-00-00 00:00:00', 2, 2, 5, 4, 0, 1, 'done', NULL, '2024-01-26 11:52:24', '2024-01-29 11:23:05', 3, NULL),
(25, '23907', '23907P_SCI celeste', 'SCI celeste', '2023-09-28 17:00:35', '0000-00-00 00:00:00', 1, 2, 1, 0, 0, 1, 'done', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', 1, NULL),
(26, '23081', '23081X_Marlink', 'Marlink', '2023-09-26 10:28:44', '0000-00-00 00:00:00', 3, 2, 2, 0, 0, 1, 'done', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', 4, NULL),
(27, '23059', '23059D_Huda Totem', 'Huda Totem', '2023-09-26 10:23:11', '0000-00-00 00:00:00', 2, 2, 4, 0, 0, 1, 'blocked', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', 3, NULL),
(28, '22076', '22076X_Bureau BLS', 'Bureau BLS', '2023-09-25 17:35:46', '0000-00-00 00:00:00', 3, 2, 2, 0, 0, 1, 'blocked', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', 4, NULL),
(29, '22004', '22004X_ KOADEG', ' KOADEG', '2023-09-25 17:29:21', '0000-00-00 00:00:00', 3, 2, 4, 0, 0, 1, 'doing', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', 4, NULL),
(30, '23080', '23080X_PIERRE EDWIGE', 'PIERRE EDWIGE', '2023-09-25 16:43:53', '0000-00-00 00:00:00', 3, 2, 5, 0, 0, 1, 'done', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24', 4, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `remotes`
--

CREATE TABLE `remotes` (
  `id` int(11) NOT NULL,
  `reference` varchar(255) NOT NULL,
  `remoteDate` datetime NOT NULL,
  `status` varchar(255) DEFAULT 'En cours',
  `userID` int(11) DEFAULT 0,
  `createdAt` datetime NOT NULL,
  `updatedAt` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `remotes`
--

INSERT INTO `remotes` (`id`, `reference`, `remoteDate`, `status`, `userID`, `createdAt`, `updatedAt`) VALUES
(1, '0001', '2024-04-09 16:12:04', 'Accepté', 1, '2024-04-08 17:12:04', '2024-04-08 17:12:04'),
(2, 'fdsqfsd', '2024-04-18 00:00:00', 'Accepté', 1, '2024-04-08 16:08:58', '2024-04-08 16:08:58'),
(3, 'rezarazraz', '2024-04-25 00:00:00', 'Accepté', 1, '2024-04-08 16:12:36', '2024-04-08 16:12:36'),
(6, 'yuip', '2024-04-24 00:00:00', 'Refusé', 1, '2024-04-10 00:08:17', '2024-04-10 00:08:31');

-- --------------------------------------------------------

--
-- Table structure for table `requests`
--

CREATE TABLE `requests` (
  `id` int(11) NOT NULL,
  `description` text NOT NULL,
  `state` tinyint(1) NOT NULL DEFAULT 0,
  `file` mediumtext DEFAULT NULL,
  `createdAt` datetime NOT NULL,
  `updatedAt` datetime NOT NULL,
  `projectID` int(11) DEFAULT NULL,
  `creatorID` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `requests`
--

INSERT INTO `requests` (`id`, `description`, `state`, `file`, `createdAt`, `updatedAt`, `projectID`, `creatorID`) VALUES
(1, 'merci de le faire', 0, '[\"/./uploads/files/1706282467686-230921_Diagramme de Cas d\'Utilisation_annotÃ©.pdf\"]', '2024-01-26 15:20:16', '2024-02-12 09:15:16', 2, 1),
(2, 'fffdsfsdqfqsd', 0, NULL, '2024-04-09 15:46:25', '2024-04-09 15:46:25', 14, 1);

-- --------------------------------------------------------

--
-- Table structure for table `resetpasswordtokens`
--

CREATE TABLE `resetpasswordtokens` (
  `id` int(11) NOT NULL,
  `token` varchar(255) NOT NULL,
  `expiresAt` datetime NOT NULL,
  `expired` tinyint(1) NOT NULL DEFAULT 0,
  `userID` int(11) NOT NULL,
  `createdAt` datetime NOT NULL,
  `updatedAt` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `tasks`
--

CREATE TABLE `tasks` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `startDate` datetime NOT NULL,
  `dueDate` datetime NOT NULL,
  `blockedDate` datetime DEFAULT NULL,
  `doneDate` datetime DEFAULT NULL,
  `isVerified` tinyint(1) NOT NULL DEFAULT 0,
  `totalHours` float DEFAULT NULL,
  `state` varchar(255) NOT NULL DEFAULT 'doing',
  `meta` varchar(255) DEFAULT NULL,
  `createdAt` datetime NOT NULL,
  `updatedAt` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `tasks`
--

INSERT INTO `tasks` (`id`, `name`, `startDate`, `dueDate`, `blockedDate`, `doneDate`, `isVerified`, `totalHours`, `state`, `meta`, `createdAt`, `updatedAt`) VALUES
(1, 'Etude docs', '2024-02-12 23:00:00', '2024-02-16 23:00:00', NULL, NULL, 0, 0, 'doing', NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23'),
(2, 'Premier Rendu DCE', '2024-02-20 23:00:00', '2024-03-07 23:00:00', NULL, NULL, 0, 0, 'blocked', NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23'),
(3, 'Etude docs', '2024-02-08 23:00:00', '2024-02-13 23:00:00', NULL, NULL, 0, 0, 'doing', NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23'),
(4, 'Coffrage', '2024-02-15 23:00:00', '2024-04-02 23:00:00', NULL, NULL, 0, 0, 'doing', NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23'),
(5, 'Reprise coffrage', '2024-02-20 23:00:00', '2024-04-02 23:00:00', NULL, NULL, 0, 0, 'doing', NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23'),
(6, 'Modification coffrage et ferraillage', '2024-02-21 23:00:00', '2024-02-23 23:00:00', NULL, NULL, 0, 0, 'doing', NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23'),
(7, 'Etude docs', '2024-01-31 23:00:00', '2024-02-06 23:00:00', NULL, NULL, 0, 0, 'blocked', NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23'),
(8, 'Reprise coffrage', '2024-02-08 23:00:00', '2024-02-14 23:00:00', NULL, NULL, 0, 0, 'blocked', NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23'),
(9, 'Solde', '2024-02-13 23:00:00', '2024-02-23 23:00:00', NULL, NULL, 0, 0, 'doing', NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23'),
(10, 'Etude docs', '2024-01-31 23:00:00', '2024-02-15 23:00:00', NULL, NULL, 0, 0, 'doing', NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23'),
(11, 'Coffrage', '2024-02-16 23:00:00', '2024-02-23 23:00:00', NULL, NULL, 0, 0, 'blocked', NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23'),
(12, 'Etude docs', '2024-01-30 23:00:00', '2024-02-05 23:00:00', NULL, '2024-02-05 23:00:00', 0, 0, 'abandoned', NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23'),
(13, 'Coffrage', '2024-02-08 23:00:00', '2024-02-14 23:00:00', NULL, '2024-02-15 23:00:00', 0, 0, 'abandoned', NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23'),
(14, 'Ferraillage', '2024-02-16 23:00:00', '2024-02-21 23:00:00', NULL, NULL, 0, 0, 'done', NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23'),
(15, 'Etude docs pour plan de principe', '2024-01-23 23:00:00', '2024-01-30 23:00:00', NULL, NULL, 0, 0, 'doing', NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23'),
(16, 'Etude docs démarrage EXE', '2024-01-23 23:00:00', '2024-01-29 23:00:00', NULL, NULL, 0, 0, 'doing', NULL, '2024-01-26 11:52:23', '2024-01-29 09:35:42'),
(17, 'Coffrage et implantation/DDC pieux', '2024-01-25 23:00:00', '2024-02-01 23:00:00', NULL, '2024-02-01 23:00:00', 0, 0, 'abandoned', NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23'),
(18, 'Reprise coffrage et ferraillage fondation', '2024-02-12 23:00:00', '2024-02-21 23:00:00', NULL, '2024-02-20 23:00:00', 0, 0, 'done', NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23'),
(19, 'Etude docs', '2024-01-23 23:00:00', '2024-01-29 23:00:00', NULL, '2024-01-29 23:00:00', 0, 0, 'done', NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23'),
(20, 'dossier APD', '2024-02-12 23:00:00', '2024-02-14 23:00:00', NULL, NULL, 0, 0, 'blocked', NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23'),
(21, 'Coffrage et ferraillage', '2024-01-22 23:00:00', '2024-01-26 23:00:00', NULL, NULL, 0, 0, 'doing', NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23'),
(22, 'Etude docs', '2024-01-18 23:00:00', '2024-01-22 23:00:00', NULL, NULL, 0, 0, 'doing', NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23'),
(23, 'Coffrage ferraillage et note de calcul', '2024-01-22 23:00:00', '2024-01-29 23:00:00', NULL, NULL, 0, 0, 'doing', NULL, '2024-01-26 11:52:23', '2024-01-26 12:02:01'),
(24, 'MAJ cartouche et altipmétries ', '2024-01-31 23:00:00', '2024-01-31 23:00:00', NULL, '2024-01-31 23:00:00', 0, 0, 'abandoned', NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23'),
(25, 'Note d\'hypothèse', '2024-01-16 23:00:00', '2024-01-19 23:00:00', NULL, '2024-01-19 23:00:00', 0, 0, 'abandoned', NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23'),
(26, 'maquette béton', '2024-01-22 23:00:00', '2024-01-26 23:00:00', NULL, NULL, 0, 0, 'blocked', NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23'),
(27, 'Coffrage et qt', '2024-01-18 23:00:00', '2024-01-26 23:00:00', NULL, NULL, 0, 0, 'doing', NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23'),
(28, 'Reprise coffrage', '2024-02-06 23:00:00', '2024-02-16 23:00:00', NULL, '2024-02-07 23:00:00', 0, 0, 'abandoned', NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23'),
(29, 'reprise dossier coffrage/qt avec modification dalle', '2024-02-07 23:00:00', '2024-02-16 23:00:00', NULL, '2024-02-12 23:00:00', 0, 0, 'abandoned', NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23'),
(30, 'Ferraillage fondation', '2024-02-12 23:00:00', '2024-02-16 23:00:00', NULL, NULL, 0, 0, 'doing', NULL, '2024-01-26 11:52:23', '2024-01-26 11:52:23'),
(31, 'synthèse et ferraillage élévation', '2024-02-19 23:00:00', '2024-02-28 23:00:00', NULL, NULL, 0, 0, 'abandoned', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24'),
(32, 'Etude docs', '2024-01-11 23:00:00', '2024-01-15 23:00:00', NULL, '2024-01-11 23:00:00', 0, 0, 'abandoned', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24'),
(33, 'Rendus', '2024-01-18 23:00:00', '2024-02-02 23:00:00', NULL, NULL, 0, 0, 'blocked', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24'),
(34, 'Quantités que surface vente', '2024-01-10 23:00:00', '2024-01-12 23:00:00', NULL, NULL, 0, 0, 'doing', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24'),
(35, 'Etude docs', '2024-01-10 23:00:00', '2024-01-12 23:00:00', NULL, NULL, 0, 0, 'doing', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24'),
(36, 'Modèle de calcul', '2024-01-12 23:00:00', '2024-01-19 23:00:00', NULL, NULL, 0, 0, 'blocked', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24'),
(37, 'Reprise coffrage et ferraillage', '2024-01-22 23:00:00', '2024-01-30 23:00:00', NULL, NULL, 0, 0, 'doing', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24'),
(38, 'Reprise coffrage et ferraillage', '2024-02-05 23:00:00', '2024-02-08 23:00:00', NULL, NULL, 0, 0, 'blocked', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24'),
(39, 'Etude docs', '2024-01-10 23:00:00', '2024-01-12 23:00:00', NULL, NULL, 0, 0, 'blocked', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24'),
(40, 'Coffrage ferraillage, métré et note de calcul', '2024-01-12 23:00:00', '2024-01-19 23:00:00', NULL, '2024-01-18 23:00:00', 0, 0, 'abandoned', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24'),
(41, 'Note de calcul ', '2024-01-09 23:00:00', '2024-01-10 23:00:00', NULL, NULL, 0, 0, 'doing', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24'),
(42, 'Note de calcul dalle', '2024-01-10 23:00:00', '2024-01-12 23:00:00', NULL, NULL, 0, 0, 'blocked', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24'),
(43, 'Coffrage', '2024-01-24 23:00:00', '2024-02-02 23:00:00', NULL, NULL, 0, 0, 'abandoned', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24'),
(44, 'Etude docs', '2024-01-03 23:00:00', '2024-01-03 23:00:00', NULL, '2024-01-03 23:00:00', 0, 0, 'done', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24'),
(45, 'Coffrage', '2024-01-18 23:00:00', '2024-01-25 23:00:00', NULL, NULL, 0, 0, 'blocked', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24'),
(46, 'coffrage', '2024-02-16 23:00:00', '2024-02-21 23:00:00', NULL, '2024-02-20 23:00:00', 0, 0, 'done', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24'),
(47, 'réponse ribal', '2024-01-09 23:00:00', '2024-01-10 23:00:00', NULL, NULL, 0, 0, 'doing', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24'),
(48, 'Etude docs', '2024-01-02 23:00:00', '2024-01-05 23:00:00', NULL, NULL, 0, 0, 'doing', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24'),
(49, 'Etude docs', '2024-01-30 23:00:00', '2024-02-02 23:00:00', NULL, '2024-02-05 23:00:00', 0, 0, 'done', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24'),
(50, 'IFC', '2024-02-05 23:00:00', '2024-02-07 23:00:00', NULL, NULL, 0, 0, 'doing', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24'),
(51, 'Reprise coffrrage pcb 60', '2024-02-12 23:00:00', '2024-02-21 23:00:00', NULL, NULL, 0, 0, 'doing', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24'),
(52, 'Etude docs', '2024-01-02 23:00:00', '2024-01-12 23:00:00', NULL, NULL, 0, 0, 'doing', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24'),
(53, 'Etude docs', '2024-01-01 23:00:00', '2024-01-05 23:00:00', NULL, NULL, 0, 0, 'doing', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24'),
(54, 'Etude docs', '2023-12-28 23:00:00', '2024-01-05 23:00:00', NULL, NULL, 0, 0, 'doing', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24'),
(55, 'conception arche fond de plan coffrage', '2024-01-04 23:00:00', '2024-02-02 23:00:00', NULL, '2024-02-05 23:00:00', 0, 0, 'abandoned', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24'),
(56, 'Rendu DCE', '2024-02-05 23:00:00', '2024-02-29 23:00:00', NULL, NULL, 0, 0, 'doing', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24'),
(57, 'Etude docs', '2023-12-27 23:00:00', '2024-01-03 23:00:00', NULL, NULL, 0, 0, 'blocked', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24'),
(58, 'DQE', '2024-01-03 23:00:00', '2024-01-19 23:00:00', NULL, NULL, 0, 0, 'doing', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24'),
(59, 'Etude docs', '2023-12-25 23:00:00', '2023-12-27 23:00:00', NULL, '2023-12-27 23:00:00', 0, 0, 'abandoned', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24'),
(60, 'Dossier Coffrage et ferraillage', '2023-12-27 23:00:00', '2024-01-09 23:00:00', NULL, NULL, 0, 0, 'doing', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24'),
(61, 'Charpente métallique et réponse fondation', '2024-01-09 23:00:00', '2024-01-12 23:00:00', NULL, NULL, 0, 0, 'doing', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24'),
(62, 'Solde charpente et nc semelle', '2024-01-16 23:00:00', '2024-01-23 23:00:00', NULL, '2024-01-23 23:00:00', 0, 0, 'abandoned', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24'),
(63, 'débit', '2024-02-16 23:00:00', '2024-02-23 23:00:00', NULL, NULL, 0, 0, 'blocked', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24'),
(64, 'Coffrage et DPGF', '2023-12-18 23:00:00', '2023-12-28 23:00:00', NULL, NULL, 0, 0, 'blocked', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24'),
(65, 'Etude docs', '2023-12-24 23:00:00', '2024-01-16 23:00:00', NULL, NULL, 0, 0, 'doing', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24'),
(66, 'coffrage. Passer en semelles isolées !', '2024-02-15 23:00:00', '2024-02-28 23:00:00', NULL, NULL, 0, 0, 'done', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24'),
(67, 'Etude docs et reprise DDC voir note', '2023-12-24 23:00:00', '2024-01-12 23:00:00', NULL, NULL, 0, 2, 'doing', NULL, '2024-01-26 11:52:24', '2024-01-29 09:35:42'),
(68, 'Reprise coffrage', '2024-01-12 23:00:00', '2024-01-19 23:00:00', NULL, '2024-01-19 23:00:00', 0, 0, 'abandoned', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24'),
(69, 'Reprise IFC puis coffrage', '2024-01-24 23:00:00', '2024-01-30 23:00:00', NULL, NULL, 0, 13, 'doing', NULL, '2024-01-26 11:52:24', '2024-01-29 09:35:42'),
(70, 'Ferraillage fondation', '2024-02-05 23:00:00', '2024-02-14 23:00:00', NULL, NULL, 0, 4, 'doing', NULL, '2024-01-26 11:52:24', '2024-01-29 09:34:37'),
(71, 'Etude docs', '2023-12-28 23:00:00', '2024-01-02 23:00:00', NULL, NULL, 0, 0, 'blocked', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24'),
(72, 'Reprise coffrage et qt', '2024-01-11 23:00:00', '2024-01-19 23:00:00', NULL, NULL, 0, 0, 'doing', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24'),
(73, 'Ferraillage solde', '2024-01-22 23:00:00', '2024-02-02 23:00:00', NULL, '2024-01-26 23:00:00', 0, 0, 'done', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24'),
(74, 'Ferraillage R+1', '2024-01-26 23:00:00', '2024-01-31 23:00:00', NULL, NULL, 0, 0, 'blocked', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24'),
(75, 'Reprise coffrage', '2024-02-06 23:00:00', '2024-02-09 23:00:00', NULL, NULL, 0, 0, 'doing', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24'),
(76, 'reprise solde', '2024-02-12 23:00:00', '2024-02-21 23:00:00', NULL, NULL, 0, 0, 'blocked', NULL, '2024-01-26 11:52:24', '2024-01-26 11:52:24');

-- --------------------------------------------------------

--
-- Table structure for table `userprofiles`
--

CREATE TABLE `userprofiles` (
  `id` int(11) NOT NULL,
  `name` varchar(255) DEFAULT NULL,
  `lastName` varchar(255) DEFAULT NULL,
  `poste` varchar(255) DEFAULT NULL,
  `phone` varchar(255) DEFAULT NULL,
  `image` varchar(255) DEFAULT NULL,
  `userID` int(11) NOT NULL,
  `address` varchar(255) DEFAULT NULL,
  `hireDate` varchar(255) DEFAULT NULL,
  `createdAt` datetime NOT NULL,
  `updatedAt` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `userprofiles`
--

INSERT INTO `userprofiles` (`id`, `name`, `lastName`, `poste`, `phone`, `image`, `userID`, `address`, `hireDate`, `createdAt`, `updatedAt`) VALUES
(1, 'houssem', 'badr', NULL, NULL, NULL, 1, '', NULL, '2024-01-25 09:18:46', '2024-01-25 09:18:46'),
(2, 'Khalil', 'BEN SAID', NULL, '21316462', NULL, 2, '', NULL, '2024-01-25 09:30:03', '2024-01-25 09:30:03'),
(3, 'chef projet', '3', NULL, '21316462', NULL, 3, '', NULL, '2024-01-25 10:03:12', '2024-01-25 10:03:12'),
(4, 'chef projet', '4', NULL, '21316462', NULL, 4, '', NULL, '2024-01-25 10:05:24', '2024-01-25 10:05:24'),
(5, 'chef projet', '5', NULL, '21316462', NULL, 5, '', NULL, '2024-01-25 10:06:38', '2024-01-25 10:06:38'),
(6, 'user', 'test ', NULL, '23689978', NULL, 6, '', NULL, '2024-01-26 15:26:33', '2024-01-26 15:26:33');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `email` varchar(255) NOT NULL,
  `password` varchar(255) DEFAULT NULL,
  `role` varchar(255) NOT NULL DEFAULT 'intervenant ',
  `isSuperUser` tinyint(1) DEFAULT 0,
  `token` text DEFAULT NULL,
  `active` tinyint(1) NOT NULL DEFAULT 0,
  `isBanned` tinyint(1) NOT NULL DEFAULT 0,
  `createdAt` datetime NOT NULL,
  `updatedAt` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `email`, `password`, `role`, `isSuperUser`, `token`, `active`, `isBanned`, `createdAt`, `updatedAt`) VALUES
(1, 'houssem.badr@gmail.com', '$2b$12$pyd7n6a4.sye4XhkARDlvuiOmLXpWs1nyXxs5zD1cv5zlA75Mi.M6', 'superuser', 1, NULL, 1, 0, '2024-01-25 09:18:46', '2024-01-25 09:18:46'),
(2, 'imedattia@gmail.com', NULL, 'superuser', 1, '1b1e112b58541f801f3ff48c12af09f436ec8d8187612e0fee4a109ba425786af78e8f7eaa3de4fb3112e407556d2e66d7e571167a37010d4f8b85b5992afe62', 1, 0, '2024-01-25 09:30:03', '2024-04-07 12:07:42'),
(3, 'gayahe4754@grassdev.com', '$2b$12$yaVoDuUAAkoysQgbVYstdeCHbl9J26WP05/D/OxrGcTMgLkhn35Ee', 'Chef_projet', 0, NULL, 1, 0, '2024-01-25 10:03:12', '2024-01-25 10:04:09'),
(4, 'wocigos422@trackden.com', '$2b$12$Hy925XGd/sZAm.Wc9M9L.OnWUKWsRbTy7mw/UsTJnwtIBFYsGQuiO', 'Chef_projet', 0, NULL, 1, 0, '2024-01-25 10:05:24', '2024-01-25 10:06:11'),
(5, 'sivak61988@wuzak.com', '$2b$12$zN0gVdUNYKDGtKm0ptXPnONFiH9zfXwgNy8bDN0b7hXRVqOvZ1.9G', 'Chef_projet', 0, NULL, 1, 0, '2024-01-25 10:06:38', '2024-01-25 10:07:09'),
(6, 'hb@concerto-pr.com', '$2b$12$VPm3WjH1SNUgKnv86xViwu70BUjDaqWNztAmanYC1Mj43RiHE3K22', 'intervenant ', 0, NULL, 1, 0, '2024-01-26 15:26:33', '2024-01-26 15:27:04');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `intervenants`
--
ALTER TABLE `intervenants`
  ADD PRIMARY KEY (`id`),
  ADD KEY `intervenantID` (`intervenantID`),
  ADD KEY `projectID` (`projectID`),
  ADD KEY `taskID` (`taskID`);

--
-- Indexes for table `interventionhours`
--
ALTER TABLE `interventionhours`
  ADD PRIMARY KEY (`id`),
  ADD KEY `interventionID` (`interventionID`),
  ADD KEY `projectID` (`projectID`);

--
-- Indexes for table `leaves`
--
ALTER TABLE `leaves`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `dateDebut` (`dateDebut`),
  ADD KEY `email` (`userID`);

--
-- Indexes for table `lots`
--
ALTER TABLE `lots`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `name` (`name`);

--
-- Indexes for table `phases`
--
ALTER TABLE `phases`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `name` (`name`);

--
-- Indexes for table `projectlots`
--
ALTER TABLE `projectlots`
  ADD PRIMARY KEY (`projectID`,`lotID`),
  ADD KEY `lotID` (`lotID`);

--
-- Indexes for table `projects`
--
ALTER TABLE `projects`
  ADD PRIMARY KEY (`id`),
  ADD KEY `createdBy` (`createdBy`),
  ADD KEY `manager` (`manager`),
  ADD KEY `phaseID` (`phaseID`),
  ADD KEY `prevPhase` (`prevPhase`);

--
-- Indexes for table `remotes`
--
ALTER TABLE `remotes`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `reference` (`reference`);

--
-- Indexes for table `requests`
--
ALTER TABLE `requests`
  ADD PRIMARY KEY (`id`),
  ADD KEY `projectID` (`projectID`),
  ADD KEY `creatorID` (`creatorID`);

--
-- Indexes for table `resetpasswordtokens`
--
ALTER TABLE `resetpasswordtokens`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `token` (`token`),
  ADD KEY `userID` (`userID`);

--
-- Indexes for table `tasks`
--
ALTER TABLE `tasks`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `userprofiles`
--
ALTER TABLE `userprofiles`
  ADD PRIMARY KEY (`id`),
  ADD KEY `userID` (`userID`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `email` (`email`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `intervenants`
--
ALTER TABLE `intervenants`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=80;

--
-- AUTO_INCREMENT for table `interventionhours`
--
ALTER TABLE `interventionhours`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=31;

--
-- AUTO_INCREMENT for table `leaves`
--
ALTER TABLE `leaves`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=65;

--
-- AUTO_INCREMENT for table `lots`
--
ALTER TABLE `lots`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `phases`
--
ALTER TABLE `phases`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `projects`
--
ALTER TABLE `projects`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=31;

--
-- AUTO_INCREMENT for table `remotes`
--
ALTER TABLE `remotes`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `requests`
--
ALTER TABLE `requests`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `resetpasswordtokens`
--
ALTER TABLE `resetpasswordtokens`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `tasks`
--
ALTER TABLE `tasks`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=77;

--
-- AUTO_INCREMENT for table `userprofiles`
--
ALTER TABLE `userprofiles`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `intervenants`
--
ALTER TABLE `intervenants`
  ADD CONSTRAINT `intervenants_ibfk_1` FOREIGN KEY (`intervenantID`) REFERENCES `users` (`id`) ON DELETE SET NULL ON UPDATE CASCADE,
  ADD CONSTRAINT `intervenants_ibfk_2` FOREIGN KEY (`projectID`) REFERENCES `projects` (`id`) ON DELETE SET NULL ON UPDATE CASCADE,
  ADD CONSTRAINT `intervenants_ibfk_3` FOREIGN KEY (`taskID`) REFERENCES `tasks` (`id`) ON DELETE SET NULL ON UPDATE CASCADE;

--
-- Constraints for table `interventionhours`
--
ALTER TABLE `interventionhours`
  ADD CONSTRAINT `interventionhours_ibfk_1` FOREIGN KEY (`interventionID`) REFERENCES `intervenants` (`id`) ON DELETE SET NULL ON UPDATE CASCADE,
  ADD CONSTRAINT `interventionhours_ibfk_2` FOREIGN KEY (`projectID`) REFERENCES `projects` (`id`) ON DELETE SET NULL ON UPDATE CASCADE;

--
-- Constraints for table `leaves`
--
ALTER TABLE `leaves`
  ADD CONSTRAINT `leaves_ibfk_1` FOREIGN KEY (`userID`) REFERENCES `users` (`id`) ON DELETE SET NULL ON UPDATE CASCADE;

--
-- Constraints for table `projectlots`
--
ALTER TABLE `projectlots`
  ADD CONSTRAINT `projectlots_ibfk_1` FOREIGN KEY (`projectID`) REFERENCES `projects` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `projectlots_ibfk_2` FOREIGN KEY (`lotID`) REFERENCES `lots` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `projects`
--
ALTER TABLE `projects`
  ADD CONSTRAINT `projects_ibfk_1` FOREIGN KEY (`createdBy`) REFERENCES `users` (`id`) ON DELETE NO ACTION ON UPDATE CASCADE,
  ADD CONSTRAINT `projects_ibfk_2` FOREIGN KEY (`manager`) REFERENCES `users` (`id`) ON DELETE NO ACTION ON UPDATE CASCADE,
  ADD CONSTRAINT `projects_ibfk_3` FOREIGN KEY (`phaseID`) REFERENCES `phases` (`id`) ON DELETE SET NULL ON UPDATE CASCADE,
  ADD CONSTRAINT `projects_ibfk_4` FOREIGN KEY (`prevPhase`) REFERENCES `projects` (`id`) ON DELETE SET NULL ON UPDATE CASCADE;

--
-- Constraints for table `requests`
--
ALTER TABLE `requests`
  ADD CONSTRAINT `requests_ibfk_1` FOREIGN KEY (`projectID`) REFERENCES `projects` (`id`) ON DELETE SET NULL ON UPDATE CASCADE,
  ADD CONSTRAINT `requests_ibfk_2` FOREIGN KEY (`creatorID`) REFERENCES `users` (`id`) ON DELETE SET NULL ON UPDATE CASCADE;

--
-- Constraints for table `resetpasswordtokens`
--
ALTER TABLE `resetpasswordtokens`
  ADD CONSTRAINT `resetpasswordtokens_ibfk_1` FOREIGN KEY (`userID`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `userprofiles`
--
ALTER TABLE `userprofiles`
  ADD CONSTRAINT `userprofiles_ibfk_1` FOREIGN KEY (`userID`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
